# 1. __call__ : 인스턴스 자체를 호출가능하게 할 수 있다.
# 2. __len__ : 클래스 안에 컬랙션형 데이터가 존재할 때 len 함수로 수를 구하게 할 수 있다.
# 3. __contains__ : in 절을 이용하여 데이터를 존재하는지 확인 가능하다.
# 4. __getitem__ : 객체에 [] 연산자로 데이터를 리턴하게 할 수 있다.
# 5. __setitem__ : 객체에 [] 연산자로 데이터를 설정할 수 수 있다.
# 6. __delitem__ : 객체에 [] 연산자로 데이터를 삭제할 수 있다.
# 7. __add__ : + 연산자를 구현할 수 있다.
# 8. __sub__ : - 연산자를 구현할 수 있다.
# 9. __mul__ : * 연산자를 구현할 수 있다.

# 1. __truediv__ : / 연산자를 구현할 수 있다.
# 2. __eq__ : == 연산자를 구현할 수 있다.
# 3. __ne__ : != 연산자를 구현할 수 있다.
# 4. __lt__ : < 연산자를 구현할 수 있다.
# 5. __le__ : <= 연산자를 구현할 수 있다.
# 6. __gt__ : > 연산자를 구현할 수 있다.
# 7. __ge__ : >= 연산자를 구현할 수 있다.


